% 任务：用遗传算法优化旅行商问题

% 清屏
clear                           % 清理工作区
clc                             % 清理命令行
close all                       % 关闭所有图形窗口
tic                             % 开始计时（tic-toc为对应的两个命令)

% 新建变量：十四个客户点
X = [16.47, 96.10
    16.47, 94.44
    20.09, 92.54
    22.39, 93.37
    25.23, 97.24
    22.00, 96.05
    20.47, 97.02
    17.20, 96.29
    16.30, 97.38
    14.05, 98.12
    16.53, 97.38
    21.52, 95.59
    19.41, 97.13
    20.09, 92.55];

% 参数设置
NIND = 100;                     % 种群大小
MAXGEN = 200;                   % 遗传的代数（即循环次数）
Pc = 0.9;                       % 交叉概率
Pm = 0.05;                      % 变异概率
GGAP = 0.9;                     % 代沟（即初始选择的个体占比）